---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SpanDirectionSymbolFailures.NonPlanView
source: html/e356b300-7a3f-b80f-60ae-edc2c8dd2b24.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SpanDirectionSymbolFailures.NonPlanView Property

Span Direction Symbol can only be placed in a Floor Plan View.

## Syntax (C#)
```csharp
public static FailureDefinitionId NonPlanView { get; }
```